SOAPUtil/bin/msg/CISACTAA_RQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:leg="http://com.seagullsw.appinterface/LegasuiteCICSEngine">
   <soapenv:Header/>
   <soapenv:Body>
      <leg:CISACTAA>
         <LEG315-COMM-REC xmlns="">
        <LEG315-A-PROC>O</LEG315-A-PROC>
        <LEG315-A-CICS>R</LEG315-A-CICS>
        <LEG315-A-APPL>LEG</LEG315-A-APPL>
        <LEG315-A-PROG>PLAE010</LEG315-A-PROG>
        <LEG315-A-USER>S682153</LEG315-A-USER>
        <LEG315-A-TRAN>XWAA</LEG315-A-TRAN>
        <LEG315-A-TERM>XWAA</LEG315-A-TERM>
        <LEG315-A-DB2-DATE>01052018005</LEG315-A-DB2-DATE>
        <LEG315-A-DB2-TIME>16330700</LEG315-A-DB2-TIME>
        <LEG315-I-ACCT-HOLD-CO>1</LEG315-I-ACCT-HOLD-CO>
        <LEG315-I-ACCT-BANK-NO>001</LEG315-I-ACCT-BANK-NO>
        <LEG315-I-ACCT-APPL>IDA</LEG315-I-ACCT-APPL>
        <LEG315-I-ACCT-NO>011836814</LEG315-I-ACCT-NO>
        <LEG315-I-CUST-HOLD-CO>1</LEG315-I-CUST-HOLD-CO>
        <LEG315-I-CUST-BANK-NO>1</LEG315-I-CUST-BANK-NO>
        <LEG315-I-CUST-APPL>CUST</LEG315-I-CUST-APPL>
        <LEG315-I-CUST-NO>00001886596</LEG315-I-CUST-NO>
        <LEG315-I-RLEN-E1-T0-E2>005</LEG315-I-RLEN-E1-T0-E2>
        <LEG315-I-ACCT-REQ>A</LEG315-I-ACCT-REQ>
        <LEG315-I-ACCT-IND>Y</LEG315-I-ACCT-IND>
        <LEG315-I-ADDR-IND>Y</LEG315-I-ADDR-IND>
        <LEG315-I-ACLG-IND>Y</LEG315-I-ACLG-IND>
        <LEG315-I-ADLG-IND>Y</LEG315-I-ADLG-IND>
        <LEG315-I-ADDR-OVERRIDE>Y</LEG315-I-ADDR-OVERRIDE>
        <LEG315-ANAM-EFF-DATE>0</LEG315-ANAM-EFF-DATE>
        <LEG315-ANAM-PROCESS-TIME>0</LEG315-ANAM-PROCESS-TIME>
        <LEG315-ANAM-NAME-LINE>MARISOL PEREZ-ACOSTA</LEG315-ANAM-NAME-LINE>
        <LEG315-ANAM-NAME-TITLE-1></LEG315-ANAM-NAME-TITLE-1>
        <LEG315-ANAM-NAME-TITLE-2></LEG315-ANAM-NAME-TITLE-2>
        <LEG315-ANAM-ACCOUNT-DESC></LEG315-ANAM-ACCOUNT-DESC>
        <LEG315-ADDR-ADDR-DATA>
          <item>
            <LEG315-ADDR-LINE-TYPE>A</LEG315-ADDR-LINE-TYPE>
            <LEG315-ADDR-LINE>CASA J 1 LAS ARENAS</LEG315-ADDR-LINE>
          </item>
          <item>
            <LEG315-ADDR-LINE-TYPE>S</LEG315-ADDR-LINE-TYPE>
            <LEG315-ADDR-LINE>KM 15 HM 9 CARR 101 INT</LEG315-ADDR-LINE>
          </item>
          <item>
            <LEG315-ADDR-LINE-TYPE>C</LEG315-ADDR-LINE-TYPE>
            <LEG315-ADDR-LINE>BOQUERON PR 00622-9703</LEG315-ADDR-LINE>
          </item>
          <item>
            <LEG315-ADDR-LINE-TYPE></LEG315-ADDR-LINE-TYPE>
            <LEG315-ADDR-LINE></LEG315-ADDR-LINE>
          </item>
          <item>
            <LEG315-ADDR-LINE-TYPE></LEG315-ADDR-LINE-TYPE>
            <LEG315-ADDR-LINE></LEG315-ADDR-LINE>
          </item>
        </LEG315-ADDR-ADDR-DATA>
        <LEG315-ACCT-STATUS></LEG315-ACCT-STATUS>
        <LEG315-ACCT-BRANCH>011</LEG315-ACCT-BRANCH>
        <LEG315-ACCT-LST-MNT-DATE>01052018005</LEG315-ACCT-LST-MNT-DATE>
        <LEG315-ACCT-LST-MNT-OPER></LEG315-ACCT-LST-MNT-OPER>
        <LEG315-ACCT-TYPE>00025</LEG315-ACCT-TYPE>
        <LEG315-ACCT-PRIM-OFF>82153</LEG315-ACCT-PRIM-OFF>
        <LEG315-ACCT-SEC-OFF>0</LEG315-ACCT-SEC-OFF>
        <LEG315-ACCT-CYC-CODE></LEG315-ACCT-CYC-CODE>
        <LEG315-ACCT-MAIL-CODE>9</LEG315-ACCT-MAIL-CODE>
        <LEG315-ACCT-SOURCE></LEG315-ACCT-SOURCE>
        <LEG315-ACCT-ACCT-OPEN>01052018005</LEG315-ACCT-ACCT-OPEN>
        <LEG315-ACCT-ACCT-CLOSED>0</LEG315-ACCT-ACCT-CLOSED>
        <LEG315-ACCT-MISC-DEMO-1>4</LEG315-ACCT-MISC-DEMO-1>
        <LEG315-ACCT-MISC-DEMO-2>00001</LEG315-ACCT-MISC-DEMO-2>
        <LEG315-ACCT-MISC-DEMO-3>2</LEG315-ACCT-MISC-DEMO-3>
        <LEG315-ACCT-MISC-DEMO-4></LEG315-ACCT-MISC-DEMO-4>
        <LEG315-ACCT-MISC-DEMO-5></LEG315-ACCT-MISC-DEMO-5>
        <LEG315-ACCT-MISC-DEMO-6></LEG315-ACCT-MISC-DEMO-6>
        <LEG315-ACCT-MISC-DEMO-7></LEG315-ACCT-MISC-DEMO-7>
        <LEG315-ACCT-MISC-DEMO-8></LEG315-ACCT-MISC-DEMO-8>
        <LEG315-ACCT-MISC-DEMO-9></LEG315-ACCT-MISC-DEMO-9>
        <LEG315-ACCT-MISC-DEMO-10></LEG315-ACCT-MISC-DEMO-10>
        <LEGY315-ANAM-LAST-CHANGE>0</LEGY315-ANAM-LAST-CHANGE>
        <LEGY315-ACCT-LAST-MNT-TIME>0</LEGY315-ACCT-LAST-MNT-TIME>
        <LEGY315-ACCT-PROCESS-TIME>0</LEGY315-ACCT-PROCESS-TIME>
        <LEGY315-ACCT-PREV-MNT-DATE>0</LEGY315-ACCT-PREV-MNT-DATE>
        <LEGY315-ADDR-REF-NO>0</LEGY315-ADDR-REF-NO>
        <LEGY315-ADDR-PROCESS-TIME>0</LEGY315-ADDR-PROCESS-TIME>
        <LEGY315-ADDR-LAST-CHANGE>0</LEGY315-ADDR-LAST-CHANGE>
      </LEG315-COMM-REC>
      </leg:CISACTAA>
   </soapenv:Body>
</soapenv:Envelope>